services/backend/src/jmeter/jmeter.log
2025-12-27 03:22:11,571 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-12-27 03:22:11,620 INFO o.a.j.JMeter: Loading user properties from: C:\Program Files\java\apache-jmeter-5.6.3\bin\user.properties
2025-12-27 03:22:11,621 INFO o.a.j.JMeter: Loading system properties from: C:\Program Files\java\apache-jmeter-5.6.3\bin\system.properties
2025-12-27 03:22:11,642 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-12-27 03:22:11,642 INFO o.a.j.JMeter: Version 5.6.3
2025-12-27 03:22:11,642 INFO o.a.j.JMeter: java.version=21.0.8
2025-12-27 03:22:11,643 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2025-12-27 03:22:11,645 INFO o.a.j.JMeter: os.name=Windows 11
2025-12-27 03:22:11,645 INFO o.a.j.JMeter: os.arch=amd64
2025-12-27 03:22:11,645 INFO o.a.j.JMeter: os.version=10.0
2025-12-27 03:22:11,645 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-12-27 03:22:11,645 INFO o.a.j.JMeter: java.awt.headless=true
2025-12-27 03:22:11,645 INFO o.a.j.JMeter: Max memory     =1073741824
2025-12-27 03:22:11,645 INFO o.a.j.JMeter: Available Processors =8
2025-12-27 03:22:11,670 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-12-27 03:22:11,671 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-12-27 03:22:11,671 INFO o.a.j.JMeter: JMeterHome=C:\Program Files\java\apache-jmeter-5.6.3
2025-12-27 03:22:11,671 INFO o.a.j.JMeter: user.dir  =D:\Coding\CreditXAI\services\backend
2025-12-27 03:22:11,672 INFO o.a.j.JMeter: PWD       =D:\Coding\CreditXAI\services\backend
2025-12-27 03:22:11,695 INFO o.a.j.JMeter: IP: 192.168.1.38 Name: Soulaimane FullName: host.docker.internal
2025-12-27 03:22:11,743 INFO o.a.j.s.FileServer: Default base='D:\Coding\CreditXAI\services\backend'
2025-12-27 03:22:11,748 INFO o.a.j.s.FileServer: Set new base='D:\Coding\CreditXAI\services\backend\.\src\jmeter'
2025-12-27 03:22:12,264 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-12-27 03:22:12,388 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-12-27 03:22:12,404 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-12-27 03:22:12,413 INFO o.a.j.s.SaveService: Loading file: .\src\jmeter\load_test.jmx
2025-12-27 03:22:12,817 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-27 03:22:12,818 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-27 03:22:12,818 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-27 03:22:12,818 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-27 03:22:12,818 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-12-27 03:22:12,818 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-12-27 03:22:12,874 INFO o.a.j.JMeter: Creating summariser <summary>
2025-12-27 03:22:12,910 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-12-27 03:22:12,912 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-12-27 03:22:12,912 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-12-27 03:22:12,923 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-12-27 03:22:12,923 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-12-27 03:22:13,147 INFO o.a.j.JMeter: Running test (1766802133147)
2025-12-27 03:22:13,186 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group
2025-12-27 03:22:13,186 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Thread Group.
2025-12-27 03:22:13,187 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-12-27 03:22:13,187 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2025-12-27 03:22:13,195 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-12-27 03:22:13,196 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-12-27 03:22:13,204 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-1
2025-12-27 03:22:13,257 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = Soulaimane
2025-12-27 03:22:13,271 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-12-27 03:22:13,274 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-12-27 03:22:13,275 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-12-27 03:22:13,275 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-12-27 03:22:13,275 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-12-27 03:22:13,718 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-1
2025-12-27 03:22:13,718 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-1
2025-12-27 03:22:13,719 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-12-27 03:22:13,775 INFO o.a.j.r.Summariser: summary =      1 in 00:00:01 =    1.6/s Avg:   220 Min:   220 Max:   220 Err:     1 (100.00%)